In [1]:
import datetime
from datetime import datetime, date
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from IPython.display import Image
#
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 10)
pd.set_option('display.width', 250)
#
%matplotlib inline

In [2]:
dates = pd.date_range('2019-01-01', '2019-01-06')
temps1 = pd.Series([80,82,85,90,83,87], index= dates)

In [3]:
temps2 = pd.Series([70, 75,69,83, 79,77], index = dates)
temps_diffs = temps1 - temps2
temps_diffs

2019-01-01    10
2019-01-02     7
2019-01-03    16
2019-01-04     7
2019-01-05     4
2019-01-06    10
Freq: D, dtype: int64

In [4]:
temps_diffs.mean()

9.0

In [5]:
temps_df = pd.DataFrame(
    {
        'Missoula' : temps1,
        'Philadelphia' : temps2
    }
)
temps_df

            Missoula  Philadelphia
2019-01-01        80            70
2019-01-02        82            75
2019-01-03        85            69
2019-01-04        90            83
2019-01-05        83            79
2019-01-06        87            77

In [6]:
temps_df['Missoula']

2019-01-01    80
2019-01-02    82
2019-01-03    85
2019-01-04    90
2019-01-05    83
2019-01-06    87
Freq: D, Name: Missoula, dtype: int64

In [7]:
temps_df[['Philadelphia','Missoula']]

            Philadelphia  Missoula
2019-01-01            70        80
2019-01-02            75        82
2019-01-03            69        85
2019-01-04            83        90
2019-01-05            79        83
2019-01-06            77        87

In [8]:
temps3 = pd.Series([75, 77, 67, 82, 77, 85], index=dates)
temps_df2 = pd.DataFrame(
        {
        'Missoula': temps1,
        'Philadelphia': temps2,
        'Seoul': temps3,
        }
)
#temps_df2  # 출력부분을 임시로 주석함

In [9]:
print('Missoula \t평균기온 : {0:.2f}'.format(temps1.mean()))   # {} 서식문자를 사용한 부분을 기억하세요.
print('Philadelphia \t평균기온 : {0:.2f}'.format(temps2.mean())) 
print('Seoul \t\t평균기온 : {0:.2f}'.format(temps3.mean()))

Missoula 	평균기온 : 84.50
Philadelphia 	평균기온 : 75.50
Seoul 		평균기온 : 77.17

In [10]:
round(temps_df2.mean(),2)  # 반올림 함수를 함 사용함

Missoula        84.50
Philadelphia    75.50
Seoul           77.17
dtype: float64

In [11]:
temps_df.Missoula

2019-01-01    80
2019-01-02    82
2019-01-03    85
2019-01-04    90
2019-01-05    83
2019-01-06    87
Freq: D, Name: Missoula, dtype: int64

In [12]:
temps_diff = temps_df.Missoula - temps_df.Philadelphia
temps_diff

2019-01-01    10
2019-01-02     7
2019-01-03    16
2019-01-04     7
2019-01-05     4
2019-01-06    10
Freq: D, dtype: int64

In [13]:
temps_df.columns

Index(['Missoula', 'Philadelphia'], dtype='object')

In [14]:
temps_df['Difference'] = temps_diffs
temps_df

            Missoula  Philadelphia  Difference
2019-01-01        80            70          10
2019-01-02        82            75           7
2019-01-03        85            69          16
2019-01-04        90            83           7
2019-01-05        83            79           4
2019-01-06        87            77          10

In [15]:
temps_df.columns

Index(['Missoula', 'Philadelphia', 'Difference'], dtype='object')

In [16]:
temps_df.Difference[1:4]

2019-01-02     7
2019-01-03    16
2019-01-04     7
Freq: D, Name: Difference, dtype: int64

In [17]:
temps_df.iloc[1]  # 1번째 로우의 데이터를 참조함 단, 맨 처음로우는 0임

Missoula        82
Philadelphia    75
Difference       7
Name: 2019-01-02 00:00:00, dtype: int64

In [18]:
temps_df.iloc[1].index

Index(['Missoula', 'Philadelphia', 'Difference'], dtype='object')

In [19]:
temps_df.loc['2019-01-05'] # loc함수는 인덱스 레이블(컬럼값)에
    #해당하는 로우 값을 참조한다.

Missoula        83
Philadelphia    79
Difference       4
Name: 2019-01-05 00:00:00, dtype: int64

In [20]:
temps_df.iloc[[1, 3, 5]]

            Missoula  Philadelphia  Difference
2019-01-02        82            75           7
2019-01-04        90            83           7
2019-01-06        87            77          10

In [21]:
temps_df.Missoula > 82

2019-01-01    False
2019-01-02    False
2019-01-03     True
2019-01-04     True
2019-01-05     True
2019-01-06     True
Freq: D, Name: Missoula, dtype: bool

In [22]:
temps_df[temps_df.Missoula > 82]

            Missoula  Philadelphia  Difference
2019-01-03        85            69          16
2019-01-04        90            83           7
2019-01-05        83            79           4
2019-01-06        87            77          10

In [23]:
temps_df['Seoul'] = temps3
temps_df

            Missoula  Philadelphia  Difference  Seoul
2019-01-01        80            70          10     75
2019-01-02        82            75           7     77
2019-01-03        85            69          16     67
2019-01-04        90            83           7     82
2019-01-05        83            79           4     77
2019-01-06        87            77          10     85

# 28일차 강의 시작

In [24]:
%pfile data/goog.csv

Object `data/goog.csv` not found.
File `'data/goog.csv'` not found.

In [51]:
df = pd.read_csv('../DATA/goog.csv') # ipynb 파일이 존재하는 디렉터리의 하위디렉터리인
   # data 디렉터리에 존재하는 goog.csv파일을 오픈하겠다는 의미입니다 
df

          Date        Open        High         Low       Close   Volume
0   12/19/2016  790.219971  797.659973  786.270020  794.200012  1225900
1   12/20/2016  796.760010  798.650024  793.270020  796.419983   925100
2   12/21/2016  795.840027  796.676025  787.099976  794.559998  1208700
3   12/22/2016  792.359985  793.320007  788.580017  791.260010   969100
4   12/23/2016  790.900024  792.739990  787.280029  789.909973   623400
..         ...         ...         ...         ...         ...      ...
56   3/13/2017  844.000000  848.684998  843.250000  845.539978  1149500
57   3/14/2017  843.640015  847.239990  840.799988  845.619995   779900
58   3/15/2017  847.590027  848.630005  840.770020  847.200012  1379600
59   3/16/2017  849.030029  850.849976  846.130005  848.780029   970400
60   3/17/2017  851.609985  853.400024  847.109985  852.119995  1712300

[61 rows x 6 columns]

In [ ]:
df.Date

In [ ]:
df.Open

In [ ]:
df3 = df.iloc[0:3]
df3

In [ ]:
df3 = df.iloc[0:3,4:]
df3

In [ ]:
df4 = df.iloc[0:3,3:5]
df4

In [ ]:
df5 = df.iloc[1:61:2]
df5

### 실습-1.  
df에 있는 자료 중에서 홀수의 행만을 출력하는 코드를 작성하세요.  
df.iloc[1,3,5,7,9,11,13,15,17, ... ,:] 과 같은 코드는 안됩니다.

In [ ]:
# 28일차-실습-1-해답
df6 = df.iloc[1: :2] # 슬라이싱 문법입니다.
df6

In [ ]:
#실습-2-해답-ver1
df21 = df.iloc[list(range(0,61,2)) ,2:4]
df21

In [ ]:
#실습-2-해답-ver2
df22 = df.iloc[  [i for i in range (0,61,2)], 2:4]
df22

In [ ]:
#실습-2-해답-ver3
ls = [x for x in df.index if x % 2 == 0]
df.loc[df.index % 2==1]
df23 = df.loc[ls, ['High','Low']]
df23

In [ ]:
#실습-2-해답-ver4
df24 = df.loc[df.index % 2 == 0, ['High','Low']]
df24

# 강의-2  시작지점
## 인덱스를 만들거나 변경하기

In [29]:
df.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60], dtype=int64)

## df 에는 모두 몇개의 셀이 있나요? ->366 
## df 에는 인덱스가 있나요? -> 0 ~ 61 
## 인덱스는 누가 만들었나요? -> 자동생성 
## 인덱스가 필요한 목적은 무엇인가요? -> 요소를 제어하기 위해서입니다.

In [30]:
# Date 열에 저장되어있는 데이터는 단지 문자열입니다
# 지난 학습일에 시리즈를 만들 때 요소를 만들고 인덱스를 함께 만들었던 것을 상기하세요
# 현재 df엔 오직 문자열들로 구성된 자료만 들어가 있습니다
# 시리즈를 만들 때, 인덱스가 DateTime타입인 경우에 특별한 이름으로 부른다고 했습니다
# DateTime타입의 인덱스를 가지고 있는 시리즈는 무엇인가요? -> 시계열 
print(type(df.Date[0]))
print(df.Date[0])

<class 'str'>
12/19/2016

In [52]:
import datetime


# df2 = df
# str2date = []
# for i in df.Date:
#     #print(type(i), i)
#     str2date.append(datetime.datetime.strptime(i, '%m/%d/%Y'))

# df2['Date'] = str2date

df31 = pd.read_csv('data/goog.csv', parse_dates=['Date'])

In [53]:
df2

         Date        Open        High         Low       Close   Volume
0  2016-12-19  790.219971  797.659973  786.270020  794.200012  1225900
1  2016-12-20  796.760010  798.650024  793.270020  796.419983   925100
2  2016-12-21  795.840027  796.676025  787.099976  794.559998  1208700
3  2016-12-22  792.359985  793.320007  788.580017  791.260010   969100
4  2016-12-23  790.900024  792.739990  787.280029  789.909973   623400
..        ...         ...         ...         ...         ...      ...
56 2017-03-13  844.000000  848.684998  843.250000  845.539978  1149500
57 2017-03-14  843.640015  847.239990  840.799988  845.619995   779900
58 2017-03-15  847.590027  848.630005  840.770020  847.200012  1379600
59 2017-03-16  849.030029  850.849976  846.130005  848.780029   970400
60 2017-03-17  851.609985  853.400024  847.109985  852.119995  1712300

[61 rows x 6 columns]